system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
format ascii;
class dictionary;
location    "system";
object controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application icoFoam;

startFrom startTime;
//startFrom       latestTime;

startTime  0.0;

stopAt endTime;

endTime         2;

deltaT          5e-6;

writeControl timeStep;

//writeInterval  2000; 200
writeInterval  10000;

purgeWrite      0;

writeFormat ascii;

writePrecision  6;

writeCompression off;

timeFormat general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo           0.4;

maxDelta  1e-5;
// ************************************************************************* //
