constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    INLET
    {
        type            patch;
        nFaces          81;
        startFace       11631;
    }
    WALS
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2136;
        startFace       11712;
    }
    OUTLET
    {
        type            patch;
        nFaces          9;
        startFace       13848;
    }
)

// ************************************************************************* //
