system/refineMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      refineMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

set             bottleneck;//网格集合名字

coordinateSystem global;

globalCoeffs//全局坐标
{
    tan1            (1 0 0);//X方向
    tan2            (0 1 0);//Y方向
    // normal
}

directions      ( tan1 tan2 );//在哪个方向加密

useHexTopology  yes;

geometricCut    no;

writeMesh       no;


// ************************************************************************* //
