system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // porousBlockage
    {
        name    bottleneck;
        type    cellSet;
        action  new;
        source  boxToCell;
        //box     (0.08 0.015 0) (0.1 0.035 0.001);
        //box     (0.09 0.02 0) (0.1 0.03 0.001);
        box     (0.095 0.022 0) (0.1 0.028 0.001);
    }
);


// ************************************************************************* //
